from enum import Enum

class ModelName(Enum):
    BREATING_VALVE = "top_el_14"
    MANHOLE_COVER = "middle_el_14"
    XLOPUSHA_XP = "middle_el_15"

class ModelTitle(Enum):
    BREATING_VALVE = "Дыхательный клапан"
    MANHOLE_COVER = "Люк‑лаз"
    XLOPUSHA_XP = "Хлопуша ХП"

class ModelDescription(Enum):
    BREATING_VALVE = """Дыхательные клапаны КДС предназначены для сокращения потерь нефти от испарения. Уменьшение потерь обеспечивается за счет сокращения выхода газов при закачивании нефти и изменения температуры, давления и упругости паров нефти в резервуаре в течение суток. Дыхательные клапаны работают при рабочем давлении до 2 кПа и вакууме 0,25 кПа.\n
Клапаны КДС могут выполнять функции как дыхательных, так и предохранительных клапанов.\n
Дыхательные клапаны также служат для регулирования давления в газовом пространстве или вакуума вертикальных резервуаров.\n
Благодаря дыхательным клапанам обеспечивается взрывобезопасная эксплуатация резервуаров. Во время хранения нефтепродуктов или выполнения операций слива и налива нефтепродуктов вследствие испарения образуются пары в газовом пространстве. Кроме того, давление в резервуаре характеризуется нестабильностью вследствие колебаний температуры окружающего воздуха. Возможно также попадание наружного воздуха в корпус резервуара в процессе его эксплуатации. В результате этих процессов («дыхания») растет давление в газовом пространстве, что может вызвать разрушение стенки, выдавливание крыши или взрыв. Для исключения таких ситуаций применяются дыхательные и предохранительные клапаны.\n
Кроме этого дыхательные клапаны обеспечивают герметичность резервуара, уменьшают потери нефтепродуктов за счет испарения, уменьшают загрязнение окружающей среды, исключают попадание пыли, песка и других частиц в резервуар, предотвращают смешение верхних и насыщенных нижних слоев.\n
Различают два типа дыхательных клапанов: с механическим затвором и с гидравлическим затвором. Последние могут использоваться в качестве предохранительных клапанов.\n
Механические дыхательные клапаны любого типа в процессе работы выпускают излишки образовавшегося пара или подают в резервуар атмосферный воздух. Конструктивной особенностью клапана является наличие нормально закрытого затвора. В процессе малого (при испарении) или большого (при заполнении) дыханиях тарелка затвора поднимается из седла. Критические значения показателей, при которых происходит срабатывание клапана, устанавливаются на избыток давления газовоздушной смеси или избыток вакуума.
"""
    MANHOLE_COVER = """Люк‑лаз — это конструктивный элемент промышленного оборудования, представляющий собой герметичное отверстие с крышкой, которое монтируется в стенках или крышах резервуаров, ёмкостей, аппаратов, цистерн, колодцев и других замкнутых пространств. Его главная функция — обеспечить безопасный и удобный доступ персонала внутрь конструкции для выполнения различных работ.\n
Основное назначение люка‑лаза заключается в организации доступа внутрь ёмкости с целью проведения плановых и внеплановых технических операций. К ним относятся: осмотр внутренних поверхностей на предмет коррозии, трещин, деформаций или иных повреждений; очистка от осадков, отложений, шлама или остатков продукта; выполнение ремонтных работ, включая сварку, замену элементов и устранение протечек; монтаж, демонтаж или обслуживание установленного внутри оборудования (насосов, датчиков, мешалок, трубопроводов и т. д.); отбор проб и контроль качества содержимого; проведение регламентных испытаний и проверок."""

    XLOPUSHA_XP = """Хлопуша ХП — это устройство, устанавливаемое внутри вертикального резервуара на приёмо‑раздаточном патрубке для обеспечения операций налива и слива нефтепродукта, а также для дополнительной защиты от его утечки в случае повреждения трубопровода или неисправности запорной арматуры. Конструкция включает корпус с наклонным срезом и плотно прилегающую к нему крышку из искробезопасного материала (обычно алюминиевого сплава), соединённую с корпусом рычажным механизмом. При наполнении резервуара струя жидкости под давлением самостоятельно приподнимает крышку, а после остановки перекачки крышка опускается под действием собственного веса, герметично закрывая проход. При выдаче продукта из резервуара крышка открывается принудительно — с помощью механизма управления (вращающегося барабана с тросом). В аварийных ситуациях устройство позволяет оперативно перекрыть поток нефтепродукта. Маркировка «ХП» расшифровывается как «хлопуша на патрубок», а последующие цифры в обозначении (например, ХП‑250) указывают на условный проход в миллиметрах. Изделие выпускается в разных климатических исполнениях (в т. ч. для умеренного и холодного климата) согласно ГОСТ 15150‑69 и соответствует техническим условиям ТУ 3689‑020‑10524112‑2006."""
