from enum import Enum

class SceneName(Enum):
    BARREL = "BarrelScene"

class SceneTitle(Enum):
    BARREL = "РВСП-5000"

class SceneDescription(Enum):
    BARREL = "<b>Характеристики сцены:</b>\n" \
    "Возможно свободно перемещаться по сцене и объекту, просматривать учебные материалы." \
    "\n<b>Описание объекта:</b>\nРВСП-5000 — представляет собой вертикальный цилиндрический резервуар со стационарным покрытием. " \
    "Предназначен для измерения объёма, а также приёма, хранения и отпуска нефти и нефтепродуктов. " \
    "Внутри резервуара устанавливается металлический понтон, закрывающий зеркало продукта и сокращающий потери " \
    "нефти и нефтепродуктов от «больших» и «малых» дыханий. Понтон защищает жидкость от нагревания и уменьшает " \
    "площадь испарения жидкости на 90…95 %. Стальные вертикальные цилиндрические резервуары имеют следующее " \
    "оборудование: дыхательные и предохранительные клапаны; стационарные пробоотборники; огневые предохранители, " \
    "приборы контроля и сигнализации; противопожарное оборудование; сифонный водоспускной кран, " \
    "вентиляционные патрубки; приемораздаточные патрубки, хлопуши; люки-лазы, световые и измерительные; диски-отражатели."
